In [1]:
import os

In [2]:
os.listdir()

['.ipynb_checkpoints',
 'Hamoye Stage A quiz code.ipynb',
 'hamoyedata.csv',
 'hamoyeVIZ.ipynb',
 'map1.html',
 'MAPPING',
 'myexercise',
 'mynames.txt',
 'myprogramlist',
 'myproject',
 'MYWEBSITE',
 'New Text Document.txt',
 'number.txt',
 'python for data visualization.ipynb',
 'pythonHandbook',
 'Untitled.ipynb']

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
fuel_data=pd.read_csv("hamoyedata.csv ")

In [6]:
fuel_data

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533.0,1.000,2.77,2.77,2.570
...,...,...,...,...,...,...,...,...,...,...,...
29518,f1_fuel_2018_12_12_0_13,12,2018,neil simpson ct #1,gas,mcf,18799.0,1.059,4.78,4.78,9.030
29519,f1_fuel_2018_12_12_1_1,12,2018,cheyenne prairie 58%,gas,mcf,806730.0,1.050,3.65,3.65,6.950
29520,f1_fuel_2018_12_12_1_10,12,2018,lange ct facility,gas,mcf,104554.0,1.060,4.77,4.77,8.990
29521,f1_fuel_2018_12_12_1_13,12,2018,wygen 3 bhp 52%,coal,ton,315945.0,16.108,3.06,14.76,1.110
29522,f1_fuel_2018_12_12_1_14,12,2018,wygen 3 bhp 52%,gas,mcf,17853.0,1.059,0.00,0.00,11.680

In [7]:
fuel_data.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533.0,1.000,2.77,2.77,2.570

In [11]:
#question 1

In [13]:
A=[1,2,3,4,5,6]
B=[13,21,34]
A_B=np.concatenate([A,B])

In [14]:
A_B

array([ 1,  2,  3,  4,  5,  6, 13, 21, 34])

In [15]:
#question 2

In [16]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [17]:
#Question 3

In [19]:
fuel_data.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533.0,1.000,2.77,2.77,2.570

In [23]:
fuel_data.groupby("fuel_type_code_pudl")["fuel_cost_per_unit_burned"].min()

fuel_type_code_pudl
coal         0.00
gas          0.00
nuclear      0.00
oil          0.00
other     -119.04
waste     -276.08
Name: fuel_cost_per_unit_burned, dtype: float64

In [24]:
#Question 4

In [25]:
fuel_data.fuel_mmbtu_per_unit.describe()

count    29523.000000
mean         8.492111
std         10.600220
min          0.000001
25%          1.024000
50%          5.762694
75%         17.006000
max        341.260000
Name: fuel_mmbtu_per_unit, dtype: float64

In [26]:
#Question 5

In [28]:
fuel_data.fuel_qty_burned.kurt()

651.3694501337732

In [29]:
fuel_data.fuel_qty_burned.skew()

15.851495469109503

In [30]:
#Question 6

In [32]:
fuel_data.isnull().sum()

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [35]:
#question 10

In [38]:
year1=fuel_data[fuel_data["report_year"]==1998]

In [39]:
year1

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
4618,f1_fuel_1998_12_1_0_7,1,1998,rockport total aeg,coal,ton,4965881.0,17.198000,19.282,19.338,1.126
4619,f1_fuel_1998_12_1_0_10,1,1998,rockport total plant,coal,ton,10000938.0,17.196000,19.280,19.340,1.122
4620,f1_fuel_1998_12_4_0_1,4,1998,units 1 - 3,coal,ton,1974682.0,22.266000,26.550,26.540,1.190
4621,f1_fuel_1998_12_4_0_2,4,1998,units 1 - 3,gas,mcf,43048.0,1.031000,2.285,2.285,2.216
4622,f1_fuel_1998_12_4_0_4,4,1998,unit 4,coal,ton,385512.0,22.330000,26.550,26.540,1.190
...,...,...,...,...,...,...,...,...,...,...,...
5720,f1_fuel_1998_12_145_2_2,145,1998,fort lupton,oil,bbl,3206.0,5.427366,33.180,0.000,6.113
5721,f1_fuel_1998_12_145_2_3,145,1998,fort lupton,gas,mcf,439412.0,1.061000,2.509,0.000,2.364
5722,f1_fuel_1998_12_145_2_6,145,1998,fruita,gas,mcf,52091.0,0.991000,2.470,0.000,2.493
5723,f1_fuel_1998_12_145_2_9,145,1998,valmont 6,gas,mcf,347619.0,0.987000,2.413,0.000,2.445
5724,f1_fuel_1998_12_145_2_12,145,1998,fort st. vrain,gas,mcf,5034730.0,1.044000,2.384,0.000,2.282

In [40]:
year1.fuel_cost_per_unit_burned.sum()

140238.65600000002

In [41]:
year2=fuel_data[fuel_data["report_year"]==1994]

In [43]:
year2.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533.0,1.000,2.77,2.77,2.570

In [44]:
year2.fuel_cost_per_unit_burned.sum()

263292.11500000005

In [45]:
#question 10

In [50]:
data=pd.DataFrame(fuel_data.groupby("report_year")["fuel_cost_per_unit_delivered"].sum())

In [51]:
data

             fuel_cost_per_unit_delivered
report_year
1994                         7.859053e+04
1995                         3.931506e+04
1996                         1.000602e+07
1997                         1.218738e+07
1998                         3.178799e+05
1999                         2.682921e+04
2000                         1.352903e+06
2001                         8.142834e+04
2002                         5.735121e+04
2003                         6.740849e+04
2004                         1.663129e+05
2005                         5.258506e+04
2006                         4.805125e+04
2007                         5.476283e+04
2008                         7.194631e+04
2009                         7.975923e+05
2010                         1.158381e+05
2011                         7.412059e+04
2012                         7.581617e+04
2013                         2.065968e+05
2014                         2.256952e+05
2015                         3.569033e+05
2016                         1.074344e+05
2017                         4.587348e+04
2018                         4.748057e+05

In [53]:
data2=data/2

In [55]:
data2

             fuel_cost_per_unit_delivered
report_year
1994                         3.929527e+04
1995                         1.965753e+04
1996                         5.003008e+06
1997                         6.093688e+06
1998                         1.589400e+05
1999                         1.341460e+04
2000                         6.764516e+05
2001                         4.071417e+04
2002                         2.867560e+04
2003                         3.370424e+04
2004                         8.315647e+04
2005                         2.629253e+04
2006                         2.402563e+04
2007                         2.738141e+04
2008                         3.597315e+04
2009                         3.987961e+05
2010                         5.791906e+04
2011                         3.706029e+04
2012                         3.790808e+04
2013                         1.032984e+05
2014                         1.128476e+05
2015                         1.784517e+05
2016                         5.371721e+04
2017                         2.293674e+04
2018                         2.374029e+05

In [57]:
pd.DataFrame(data2.max())

                                       0
fuel_cost_per_unit_delivered  6093687.89